---
kind: method
id: M:Autodesk.Revit.DB.Architecture.Railing.GetHandRails
zh: 栏杆
source: html/7c33a83c-7114-6caf-16eb-275e0c98c330.htm
---
# Autodesk.Revit.DB.Architecture.Railing.GetHandRails Method

**中文**: 栏杆

Get all the handrails of the railing.

## Syntax (C#)
```csharp
public IList<ElementId> GetHandRails()
```

## Returns
All handrails of the railing.